namespace Guestbook.Models
{
    using Microsoft.EntityFrameworkCore;
    public class GuestbookContext : DbContext
    {
        public DbSet<User> Users { get; set; }
        public DbSet<Message> Messages { get; set; }
        public GuestbookContext(DbContextOptions<GuestbookContext> options)
            : base(options)
        {
            if (Database.EnsureCreated())
            {
                User user1 = new User { Login = "petrenko25@gmail.com", Name = "Микола", Surname = "Петренко", Password = "petr25nko", Year = 25 };
                User user2 = new User { Login = "mariakoval4@gmail.com", Name = "Марія", Surname = "Ковальчук", Password = "maria24", Year = 24 };
                User user3 = new User { Login = "ivanov20@gmail.com", Name = "Руслан", Surname = "Кривенко", Password = "qwerty123", Year = 20 };
                Users?.Add(user1);
                Users?.Add(user2);
                Users?.Add(user3);
                Messages?.Add(new Message { Date = "10.09.2026", Text = "Зупинялися тут на три ночі у бізнес-поїздці. Загалом враження нейтральні. Розташування зручне — близько до центру та транспорту. Сам номер просторий, проте меблі вже трохи втомлені, а звукоізоляція залишає бажати кращого (було чутно сусідів у коридорі). Wi-Fi працював стабільно, що для мене було головним. Сніданки смачні, але вибір скромний, якщо порівнювати з іншими готелями цієї ж цінової категорії. На один-два дні — нормально, але для тривалого відпочинку пошукав би щось інше.", User=user1 });
                Messages?.Add(new Message { Date="21.08.2026", Text = "Пів тижня тому повернулися звідси і досі під враженням. Готель перевершив усі очікування! Номери дуже чисті, світлі та з сучасним ремонтом, а ліжко — просто невагоме, спалося ідеально. Окремо хочеться відзначити персонал: усі дуже ввічливі, готові допомогти в будь-якій ситуації. Сніданки — шведський стіл із величезним вибором страв на будь-який смак (особливо запам'яталися свіжі круасани та кава). Територія доглянута, зелена, є чудовий спа-комплекс. Обов'язково повернемося сюди знову!", User = user2 });
                Messages?.Add(new Message { Date="15.09.2026", Text = "Зупинялися тут на одну ніч під час поїздки. Готель повністю відповідає своїй вартості і трьом зіркам — нічого особливого, але й критичних зауважень немає. Номер невеликий, меблі вже дещо застарілі, проте білизна була чистою. Персонал на ресепшені працює швидко та професійно, хоча й без особливої зайвої привітності. Сніданок базовий: чай, кава, омлет, тости — голодними не залишилися, але й задоволення не отримали. Нормальний варіант, якщо потрібно просто переночувати в дорозі.", User = user3  });
                SaveChanges();
            }
        }
    }
}
